app/Controllers/People.php

SELECT COUNT(*) AS `numrows`
FROM `people`
SELECT *
FROM `people`
SELECT *
FROM `people`
 LIMIT 90, 10
---
    public function index()
    {
        $listPerPage = 10;
        if ($this->request->getVar()) {
            $page = (intval($this->request->getVar("page_people")) - 1);
        } else {
            $page = 0;
        }
        $page = ($page * $listPerPage) + 1;

        $data = [
            'title' => 'People Page',
            'list_people' => $this->modelPeople->paginate($listPerPage, 'people'),
            'pager' => $this->modelPeople->pager,
            'page' => $page,
        ];